In [3]:
import pandas as pd
df=pd.read_csv('titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [7]:
df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [11]:
##missing data completely  at rnadom , embarked (MCAR)
df[df['Embarked'].isnull()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [12]:
### missing data at not random (MNAR) cabin , age

In [17]:
import numpy as np
df['Cabin_null']=np.where(df['Cabin'].isnull(),1,0)
df['Cabin_null'].mean()

0.7710437710437711

In [20]:
df.groupby(['Survived'])['Cabin_null'].mean()

Survived
0    0.876138
1    0.602339
Name: Cabin_null, dtype: float64

In [21]:
##Missing at Random (MAR)

##All techniques
1. Mean , Median, mode replacement
2. Random sample imputation
3. Capturing NAN values with a new feature
4. End of distribution impuation
5. Arbitary impuattion
6. Frequent categories imputation

#Mean , Median, mode imputation

Mean/median imputation has assumption that the data are missing completely at random (MCAR)
We solve this by replacing the NAN with the most frequent occurance of the variables

In [23]:
df=pd.read_csv('titanic.csv',usecols=['Age','Fare','Survived'])
df

     Survived   Age     Fare
0           0  22.0   7.2500
1           1  38.0  71.2833
2           1  26.0   7.9250
3           1  35.0  53.1000
4           0  35.0   8.0500
..        ...   ...      ...
886         0  27.0  13.0000
887         1  19.0  30.0000
888         0   NaN  23.4500
889         1  26.0  30.0000
890         0  32.0   7.7500

[891 rows x 3 columns]

In [28]:
df.isnull().mean()

Survived    0.000000
Age         0.198653
Fare        0.000000
dtype: float64

In [29]:
def impute_nan(df,variable,median):
    df[variable+"_median"]=df[variable].fillna(median)

In [31]:
median=df.Age.median()
median

28.0

In [34]:
impute_nan(df,'Age',median)
df

     Survived   Age     Fare  Age_median
0           0  22.0   7.2500        22.0
1           1  38.0  71.2833        38.0
2           1  26.0   7.9250        26.0
3           1  35.0  53.1000        35.0
4           0  35.0   8.0500        35.0
..        ...   ...      ...         ...
886         0  27.0  13.0000        27.0
887         1  19.0  30.0000        19.0
888         0   NaN  23.4500        28.0
889         1  26.0  30.0000        26.0
890         0  32.0   7.7500        32.0

[891 rows x 4 columns]

In [35]:
df['Age'].std()

14.526497332334044

In [36]:
df['Age_median'].std()

13.019696550973194

In [37]:
df['Age'].mean()

29.69911764705882